<div style="line-height:0.5">
<h1 style="color:lightcoral"> Pandas basics 1 </h1>
</div>
<div style="line-height:1.5">
<div style="margin-top: -10px;">
<span style="display: inline-block;">
    <h3 style="color: lightblue; display: inline;">Keywords:</h3> pd.Timestamp() + urlopen + pd.Series() + pd.to_datetime() + json.loads + pd.interpolate()
</span>
</div>
</div>

In [1]:
import re
import json
import random
import requests
import numpy as np
import pandas as pd
import matplotlib as plt
from urllib.request import urlopen

<h3 style="color:lightcoral"> Example 0 </h3>

In [2]:
""" Read from txt """
textuse = pd.read_csv (r'./data_pandas/starting_from_text.txt')
textuse.to_csv (r'./data_pandas/transformed_in_csv.csv', index=None)
textuse.head()

,Min0,Min1,Min2,Min3,Min4,Max0,Max1,Max2,Max3,Max4,...,Peak32,Peak33,Peak34,Peak35,Peak41,Peak42,Peak43,Peak44,Peak45,Response
0,0.15,0.15,0.15,0.15,0.15,0.75,0.75,0.75,0.75,0.75,...,1,0,0,0,2,1,0,0,0,hug
1,0.15,0.15,0.15,0.15,0.15,0.75,0.75,0.75,0.75,0.75,...,1,0,0,0,2,1,0,0,0,hug
2,0.15,0.15,0.15,0.15,0.15,0.75,0.75,0.75,0.75,0.75,...,1,0,0,0,2,1,0,0,0,hug
3,0.15,0.15,0.15,0.15,0.15,0.75,0.75,0.75,0.75,0.75,...,1,0,0,0,2,1,0,0,0,hug
4,0.15,0.15,0.15,0.15,0.15,0.75,0.75,0.75,0.75,0.75,...,1,0,0,0,2,1,0,0,0,hug

<h3 style="color:lightcoral"> Example 1 </h3>

In [3]:
a = np.array([[10, 7, 4], [3, 2, 1]])
print(a)

np.quantile(a, 0.5)

[[10  7  4]
 [ 3  2  1]]

3.5

In [4]:
data1 = {
    'day':['21/05/2021','7/03/2019','13/04/2005','22/11/1998','9/04/2003','27/02/2000'],
}
df = pd.DataFrame(data1)
df

          day
0  21/05/2021
1   7/03/2019
2  13/04/2005
3  22/11/1998
4   9/04/2003
5  27/02/2000

In [5]:
random_tuple1 = tuple(np.random.rand(6))
random_tuple2 = tuple(np.random.rand(6))
df['dad_agree'] = random_tuple1
df['mom_agree'] = random_tuple2

df

          day  dad_agree  mom_agree
0  21/05/2021   0.944945   0.907020
1   7/03/2019   0.622807   0.552785
2  13/04/2005   0.157541   0.910728
3  22/11/1998   0.369376   0.759598
4   9/04/2003   0.074388   0.736764
5  27/02/2000   0.682551   0.667902

In [6]:
#viceversa
tuple1 = tuple(df['mom_agree'].iloc[:3])
tuple1

(0.9070204987476667, 0.5527845627196356, 0.9107278042911614)

In [7]:
df['day'] = pd.to_datetime(df['day'], format='%d/%m/%Y')
df

         day  dad_agree  mom_agree
0 2021-05-21   0.944945   0.907020
1 2019-03-07   0.622807   0.552785
2 2005-04-13   0.157541   0.910728
3 1998-11-22   0.369376   0.759598
4 2003-04-09   0.074388   0.736764
5 2000-02-27   0.682551   0.667902

In [8]:
df.empty

False

In [9]:
""" Group the data by a column and calculate summary statistics """
df.groupby('dad_agree')['mom_agree'].mean()

dad_agree
0.074388    0.736764
0.157541    0.910728
0.369376    0.759598
0.622807    0.552785
0.682551    0.667902
0.944945    0.907020
Name: mom_agree, dtype: float64

In [10]:
""" Filter the data based on a condition """ 
new_df = df[df['dad_agree'] > 0.5]
new_df

         day  dad_agree  mom_agree
0 2021-05-21   0.944945   0.907020
1 2019-03-07   0.622807   0.552785
5 2000-02-27   0.682551   0.667902

In [11]:
""" Merge two DataFrames"""
data2 = {
    'day': pd.to_datetime(['2021-01-01', '1998-11-22', '2021-05-21']),
    'value': [100, 200, 300]
}
df2 = pd.DataFrame(data2)

## Try to merge the DataFrames
merged_df = pd.merge(df, df2, on='day')
merged_df

         day  dad_agree  mom_agree  value
0 2021-05-21   0.944945   0.907020    300
1 1998-11-22   0.369376   0.759598    200

In [12]:
## Create a second dataset with the same columns and random values
data2 = {
    'day': ['2019-01-02', '2019-01-03'],
    'dad_agree': [0.2, 0.3],
    'mom_agree': [0.5, 0.6]
}
df2 = pd.DataFrame(data2)

## Concatenate the two datasets along the rows
concat_df = pd.concat([df, df2], ignore_index=True)
concat_df

                   day  dad_agree  mom_agree
0  2021-05-21 00:00:00   0.944945   0.907020
1  2019-03-07 00:00:00   0.622807   0.552785
2  2005-04-13 00:00:00   0.157541   0.910728
3  1998-11-22 00:00:00   0.369376   0.759598
4  2003-04-09 00:00:00   0.074388   0.736764
5  2000-02-27 00:00:00   0.682551   0.667902
6           2019-01-02   0.200000   0.500000
7           2019-01-03   0.300000   0.600000

<h3 style="color:lightcoral"> Example 2 </h3>

In [13]:
%%script false --no-raise-error
# Use invalid syntax with no errors!

In [14]:
df_ran = pd.DataFrame(np.random.randn(5, 3))
df_ran

          0         1         2
0  1.647965 -0.362531  0.035427
1 -1.467700 -1.044162 -1.079310
2 -0.402335 -1.147214 -0.722737
3 -1.709006 -0.243340  0.328775
4  0.437085 -2.584666  0.495891

In [15]:
empty_dataframe = pd.DataFrame(columns=[0, 1, 2])
cho = ['aa','a','b','c','d']
oknow = random.choices(cho, k=5)
print(oknow)

['b', 'a', 'b', 'c', 'd']

In [16]:
#columns=[0, 1, 2]
empty_dataframe[0] = oknow
empty_dataframe[0]

0    b
1    a
2    b
3    c
4    d
Name: 0, dtype: object

In [17]:
df3 = pd.DataFrame({'b':range(10)}) 
a = np.random.normal(size=(10,2))   
print(a)
print()
## Save 
df3['a'] = a.tolist()       
## Retrieve
c = np.array(df3['a'].tolist()) 

print(df3)
print()
print(c)

[[ 1.83832816 -0.12326223]
 [-0.23938384 -1.41512796]
 [ 0.47985668  2.06329328]
 [ 1.58204214 -0.99460676]
 [-1.57969612 -0.06018853]
 [-0.06090497 -1.06742165]
 [ 0.04505146 -1.95186696]
 [-1.13496821 -1.08144442]
 [-0.31837596  1.28291649]
 [ 0.97917257  1.0421601 ]]

   b                                            a
0  0   [1.8383281597829533, -0.12326223168064014]
1  1  [-0.23938384467149992, -1.4151279561244519]
2  2    [0.47985668176293217, 2.0632932805656887]
3  3     [1.5820421441480266, -0.994606756765611]
4  4  [-1.5796961155221478, -0.06018853299726391]
5  5  [-0.06090496982901841, -1.0674216452321468]
6  6   [0.04505145956473421, -1.9518669646384879]
7  7   [-1.1349682103315204, -1.0814444197737978]
8  8   [-0.31837595782954226, 1.2829164911403115]
9  9     [0.9791725708058026, 1.0421601029351464]

[[ 1.83832816 -0.12326223]
 [-0.23938384 -1.41512796]
 [ 0.47985668  2.06329328]
 [ 1.58204214 -0.99460676]
 [-1.57969612 -0.06018853]
 [-0.06090497 -1.06742165]
 [ 0.04505146 -1.95186696]
 [-1.13496821 -1.08144442]
 [-0.31837596  1.28291649]
 [ 0.97917257  1.0421601 ]]

<h3 style="color:lightcoral"> Example 3 </h3>

In [18]:
df = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),columns=['a', 'b', 'c'])

if len(df['c'].unique())==3: 
    print(True)
print(df)
res = df.c.eq(df.c.iloc[0]).all()
print(res)
if len(df['c'].unique())==3: 
    print(True)

True
   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9
False
True

<h3 style="color:lightcoral"> Example 4 </h3>

In [19]:
def removeDuplicates(lst):
    """ Removes duplicates from a list of lists.
    
    Parameters:
        List of lists, where each sublist contains two elements.
    
    Returns:
        New list with duplicate elements removed, calculated directly in one instr.
    
    Details:
        - Iterate over the input list and filter out duplicates, using list comprehension;
        - Enumerate to retrieve both the index 'i' and the elements [a, b] from the lst;
        - 'any' is True if any element in the given iterable ('lst[:i]') matches the condition;
        - Check if (NOT!) any previous sublist in 'lst' has the same second element ('b') as the current sublist;
        - The sublist [a, b] is included in the new list, effectively removing duplicates, if the 'any' condition is False;
    """

    #return [[a, b] for i, [a, b] in enumerate(lst) 
    #        if not any(c == b for _, c in lst[:i])]

    return [sublist for i, sublist in enumerate(lst) if not any(sublist == s for s in lst[:i])]

In [21]:
# Read the data from CSV file into a DataFrame
df = pd.read_csv('./data_pandas/simple_dataset_2col.csv')

# Extract the required columns as a list of lists
#lst = [[row['scenario_group'], row['type']] for _, row in df.iterrows()]
lst = df.values.tolist()

In [22]:
lst[0]

['Scenario_1', '1FSUS']

In [23]:
# Pass the list of lists to the removeDuplicates function
table = removeDuplicates(lst)

# Convert the resulting list back to a DataFrame
result_df = pd.DataFrame(table, columns=['scenario_group', 'type'])

print("table after:\n", result_df)

table after:
        scenario_group        type
0          Scenario_1       1FSUS
1          Scenario_1       1FSUD
2          Scenario_1      1FSUDT
3          Scenario_1       1FCOS
4          Scenario_1       1FCOD
...               ...         ...
215210   Scenario_999    8QTSUDB1
215211   Scenario_999    8QTCODB1
215212   Scenario_999  8QTSUSCOC1
215213   Scenario_999      9CNSSU
215214   Scenario_999      9CNSPA

[215215 rows x 2 columns]

In [24]:
tab = pd.read_csv('./data_pandas/simple_dataset_2col.csv', skiprows=None, engine='python', encoding="utf-8")
print("table before:\n" ,tab)

table before:
        scenario_group        type
0          Scenario_1       1FSUS
1          Scenario_1       1FSUD
2          Scenario_1      1FSUDT
3          Scenario_1       1FCOS
4          Scenario_1       1FCOD
...               ...         ...
215210   Scenario_999    8QTSUDB1
215211   Scenario_999    8QTCODB1
215212   Scenario_999  8QTSUSCOC1
215213   Scenario_999      9CNSSU
215214   Scenario_999      9CNSPA

[215215 rows x 2 columns]

<h3 style="color:lightcoral"> Example 5 </h3>
Dataframe from json

In [ ]:
# import from folder
# Open the JSON file for reading
with open('./data_pandas/for_example_pandas.json', 'r') as f:
    data_json = json.load(f)

# Print the contents of the JSON file
print(data_json)

{'users': [{'id': 1, 'name': 'John Doe', 'email': 'johndoe@example.com', 'phone': '555-1234', 'address': {'street': '123 Main St', 'city': 'Anytown', 'state': 'CA', 'zip': '12345'}, 'orders': [{'id': 1, 'items': [{'id': 1, 'name': 'Product 1', 'price': 10.0}, {'id': 2, 'name': 'Product 2', 'price': 20.0}], 'total': 30.0}, {'id': 2, 'items': [{'id': 3, 'name': 'Product 3', 'price': 15.0}, {'id': 4, 'name': 'Product 4', 'price': 25.0}], 'total': 40.0}]}, {'id': 2, 'name': 'Jane Smith', 'email': 'janesmith@example.com', 'phone': '555-5678', 'address': {'street': '456 Second St', 'city': 'Othertown', 'state': 'NY', 'zip': '67890'}, 'orders': [{'id': 3, 'items': [{'id': 5, 'name': 'Product 5', 'price': 12.0}, {'id': 6, 'name': 'Product 6', 'price': 18.0}], 'total': 30.0}]}]}

In [ ]:
#print(json.dumps(data_json, indent=4))
first_part = [data_json[:2]]
print(json.dumps(first_part, indent=4))

[
    [
        {
            "userId": 1,
            "id": 1,
            "title": "sunt aut facere repellat provident occaecati excepturi optio reprehenderit",
            "body": "quia et suscipit\nsuscipit recusandae consequuntur expedita et cum\nreprehenderit molestiae ut ut quas totam\nnostrum rerum est autem sunt rem eveniet architecto"
        },
        {
            "userId": 1,
            "id": 2,
            "title": "qui est esse",
            "body": "est rerum tempore vitae\nsequi sint nihil reprehenderit dolor beatae ea dolores neque\nfugiat blanditiis voluptate porro vel nihil molestiae ut reiciendis\nqui aperiam non debitis possimus qui neque nisi nulla"
        }
    ]
]

In [ ]:
# URL of the JSON data
url_j = 'https://jsonplaceholder.typicode.com/posts'

# Send a GET request to retrieve the JSON data
response = requests.get(url_j)
# Get the JSON data from the response
json_data = response.json()

# Save the JSON data to a file
with open('./data_pandas/toy_data.json', 'w') as file:
    file.write(str(json_data))

In [ ]:
response = urlopen(url_j)
data_json = json.loads(response.read())

In [ ]:
data_json[0]

{'userId': 1,
 'id': 1,
 'title': 'sunt aut facere repellat provident occaecati excepturi optio reprehenderit',
 'body': 'quia et suscipit\nsuscipit recusandae consequuntur expedita et cum\nreprehenderit molestiae ut ut quas totam\nnostrum rerum est autem sunt rem eveniet architecto'}

In [ ]:
user_ids = [item['userId'] for item in data_json]
type(user_ids)
user_ids[:10]

[1, 1, 1, 1, 1, 1, 1, 1, 1, 1]

In [ ]:
print(type(data_json))
print(type(user_ids))

<class 'list'>
<class 'list'>

In [ ]:
""" Pretty print with json. 
1- Get the first part of the dictionary
2- Convert the dictionary to a JSON string with indentation
3- Print necessary also in notebooks
"""

# Sample data in dictionary format
data_js = [
    {
        'userId': 1,
        'id': 1,
        'title': 'sunt aut facere repellat provident occaecati excepturi optio reprehenderit',
        'body': 'quia et suscipit\nsuscipit recusandae consequuntur expedita et cum\nreprehenderit molestiae ut ut quas totam\nnostrum rerum est autem sunt rem eveniet architecto'
    },
    {
        'userId': 1,
        'id': 2,
        'title': 'qui est esse',
        'body': 'est rerum tempore vitae\nsequi sint nihil reprehenderit dolor beatae ea dolores neque\nfugiat blanditiis voluptate porro vel nihil molestiae ut reiciendis\nqui aperiam non debitis possimus qui neque nisi nulla'
    },
    {
        'userId': 1,
        'id': 3,
        'title': 'ea molestias quasi exercitationem repellat qui ipsa sit aut',
        'body': 'et iusto sed quo iure\nvoluptatem occaecati omnis eligendi aut ad\nvoluptatem doloribus vel accusantium quis pariatur\nmolestiae porro eius odio et labore et velit aut'
    },
    {
        'userId': 1,
        'id': 4,
        'title': 'eum et est occaecati',
        'body': 'ullam et saepe reiciendis voluptatem adipisci\nsit amet autem assumenda provident rerum culpa\nquis hic commodi nesciunt rem tenetur doloremque ipsam iure\nquis sunt voluptatem rerum illo velit'
    }
]
first_part = {k: v for k, v in data_js[0].items() if k != 'c'}
# Convert the filtered dictionary to a JSON string
json_str = json.dumps(first_part, indent=4)

print(json_str)

{
    "userId": 1,
    "id": 1,
    "title": "sunt aut facere repellat provident occaecati excepturi optio reprehenderit",
    "body": "quia et suscipit\nsuscipit recusandae consequuntur expedita et cum\nreprehenderit molestiae ut ut quas totam\nnostrum rerum est autem sunt rem eveniet architecto"
}

In [ ]:
json_str_whole = json.dumps(data_js, indent=4)
json_str = json.dumps(first_part, indent=4)
print(json_str)

{
    "userId": 1,
    "id": 1,
    "title": "sunt aut facere repellat provident occaecati excepturi optio reprehenderit",
    "body": "quia et suscipit\nsuscipit recusandae consequuntur expedita et cum\nreprehenderit molestiae ut ut quas totam\nnostrum rerum est autem sunt rem eveniet architecto"
}

In [ ]:
""" From json to pandas df. """
data_dict = {
    'Name': ['John', 'Alice', 'Bob'],
    'Age': [25, 30, 35],
    'City': ['New York', 'London', 'Paris']
}
df = pd.DataFrame.from_dict(data_dict, orient = 'index')
df

             0       1      2
Name      John   Alice    Bob
Age         25      30     35
City  New York  London  Paris

In [ ]:
""" Print the whole df with modified display options. 2 ways. """
#pd.set_option("display.max_rows", None, "display.max_columns", None)
#print(df)
# or ...
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    print(df)

             0       1      2
Name      John   Alice    Bob
Age         25      30     35
City  New York  London  Paris

In [ ]:
""" Convert the JSON data to a pandas dataframe. """
df2 = pd.read_json(json.dumps(data_json))
print(df2)

    userId   id                                              title  \
0        1    1  sunt aut facere repellat provident occaecati e...
1        1    2                                       qui est esse
2        1    3  ea molestias quasi exercitationem repellat qui...
3        1    4                               eum et est occaecati
4        1    5                                 nesciunt quas odio
..     ...  ...                                                ...
95      10   96  quaerat velit veniam amet cupiditate aut numqu...
96      10   97         quas fugiat ut perspiciatis vero provident
97      10   98                        laboriosam dolor voluptates
98      10   99  temporibus sit alias delectus eligendi possimu...
99      10  100              at nam consequatur ea labore ea harum

                                                 body
0   quia et suscipit\nsuscipit recusandae consequu...
1   est rerum tempore vitae\nsequi sint nihil repr...
2   et iusto sed quo iure\nvoluptatem occaecati om...
3   ullam et saepe reiciendis voluptatem adipisci\...
4   repudiandae veniam quaerat sunt sed\nalias aut...
..                                                ...
95  in non odio excepturi sint eum\nlabore volupta...
96  eum non blanditiis soluta porro quibusdam volu...
97  doloremque ex facilis sit sint culpa\nsoluta a...
98  quo deleniti praesentium dicta non quod\naut e...
99  cupiditate quo est a modi nesciunt soluta\nips...

[100 rows x 4 columns]

<h3 style="color:lightcoral"> Example 6</h3>

In [ ]:
## Example string
strings = ['._config.test_dataset_config.train = False',
        '}',
        '- INFO - trainer - Iter #8000 - iteration: 0.77s - forward: 0.43s - loss: 0.034s - loading_wait: 0.15s - backward: 0.16s - parallel_loading: 8.1s (0 Failed) - train_loss: 6.12e-03'
        ]

## Regular expressions to extract fields
iter_regex = r'Iter #(\d+)'
forward_regex = r'forward: ([\d\.]+)s'
loss_regex = r'loss: ([\d\.]+)s'
loading_wait_regex = r'loading_wait: ([\d\.]+)s'

## Create DataFrame from list of strings
df6 = pd.DataFrame(strings, columns=['string'])
df6

                                              string
0         ._config.test_dataset_config.train = False
1                                                  }
2  - INFO - trainer - Iter #8000 - iteration: 0.7...

In [ ]:
## Extract fields
df6['iter'] = df6['string'].apply(lambda x: re.search(iter_regex, x).group(1) if re.search(iter_regex, x) else 'Na')
df6['forward'] = df6['string'].apply(lambda x: re.search(forward_regex, x).group(1) if re.search(forward_regex, x) else 'Na')
df6['loss'] = df6['string'].apply(lambda x: re.search(loss_regex, x).group(1) if re.search(loss_regex, x) else 'Na')
df6['loading_wait'] = df6['string'].apply(lambda x: re.search(loading_wait_regex, x).group(1) if re.search(loading_wait_regex, x) else 'Na')

# Drop the 'string' column
df6.drop(columns=['string'], inplace=True)
df6

   iter forward   loss loading_wait
0    Na      Na     Na           Na
1    Na      Na     Na           Na
2  8000    0.43  0.034         0.15

<h3 style="color:lightcoral"> Example 7 </h3>
Handling Dates and Times

%Y Full year <br>
%m Month w/ zero padding  <br>
%d Day of the month (w/ zero padding)  <br>
%I Hour (12hr clock) (w/ zero padding)  <br>
%p AM or PM AM  <br>
%M Minute (w/ zero padding)  <br>
%S Second (w/ zero padding) <br>

In [ ]:
date_strings = np.array(['03-04-2005 11:35 PM', '23-05-2010 12:01 AM', '04-09-2009 09:09 PM'])
dd = [pd.to_datetime(date, format='%d-%m-%Y %I:%M %p') for date in date_strings]
datetim = [pd.to_datetime(date, format="%d-%m-%Y %I:%M %p", errors="coerce") for date in date_strings] # errors are not raide

print(dd)
print(datetim)

[Timestamp('2005-04-03 23:35:00'), Timestamp('2010-05-23 00:01:00'), Timestamp('2009-09-04 21:09:00')]
[Timestamp('2005-04-03 23:35:00'), Timestamp('2010-05-23 00:01:00'), Timestamp('2009-09-04 21:09:00')]

<h3 style="color:lightcoral"> Example 8 </h3>
Frequency

Available frequency strings include (freq param):
<div style="margin-top: -14px;">

- 'B' for business days, 
- 'W' for weekly, 
- 'M' for monthly, 
- 'Y' for yearly 
</div>

In [ ]:
datafr = pd.DataFrame() 
datafr['date'] = pd.date_range('1/1/2001', periods=100000, freq='H') 
datafr[(datafr['date'] > '2002-1-1 01:00:00') & (datafr['date'] <= '2002-1-1 04:00:00')]
datafr['new_column'] = 1

datafr2 = datafr.set_index(datafr['date'].drop(columns=['date']))
datafr2 = datafr.set_index('date')
datafr3 = datafr2.reset_index(drop=True)

# datafr4 = datafr.set_index('date').drop(columns=['date']) # not work!!
# ok work but only when the columns are more than one! otherwise the unique column values will be copied 
# in the index of an empty dataframe!
datafr5 = datafr.set_index('date', drop=True) 
datafr6 = datafr.set_index('date')
datafr7 = datafr6.rename_axis(None).reset_index()

print(datafr.head(3))
print(datafr2.head(3))
print(datafr3.head(3))
print(datafr5.head(3))
print(datafr6.head(3))
print(datafr7.head(3))

                 date  new_column
0 2001-01-01 00:00:00           1
1 2001-01-01 01:00:00           1
2 2001-01-01 02:00:00           1
                     new_column
date
2001-01-01 00:00:00           1
2001-01-01 01:00:00           1
2001-01-01 02:00:00           1
   new_column
0           1
1           1
2           1
                     new_column
date
2001-01-01 00:00:00           1
2001-01-01 01:00:00           1
2001-01-01 02:00:00           1
                     new_column
date
2001-01-01 00:00:00           1
2001-01-01 01:00:00           1
2001-01-01 02:00:00           1
                index  new_column
0 2001-01-01 00:00:00           1
1 2001-01-01 01:00:00           1
2 2001-01-01 02:00:00           1

In [ ]:
"""Breaking up date data into multiple feratures"""
dataframmo = datafr.copy()
dataframmo['year'] = dataframmo['date'].dt.year 
dataframmo['month'] = dataframmo['date'].dt.month 
dataframmo['day'] = dataframmo['date'].dt.day 
dataframmo['hour'] = dataframmo['date'].dt.hour 
dataframmo['minute'] = dataframmo['date'].dt.minute 
dataframmo.head(3)

                 date  new_column  year  month  day  hour  minute
0 2001-01-01 00:00:00           1  2001      1    1     0       0
1 2001-01-01 01:00:00           1  2001      1    1     1       0
2 2001-01-01 02:00:00           1  2001      1    1     2       0

In [ ]:
data_frame = pd.DataFrame()
data_frame['Arrived'] = [pd.Timestamp('01-01-2017'), pd.Timestamp('01-04-2017')]
data_frame['Left'] = [pd.Timestamp('01-01-2017'), pd.Timestamp('01-06-2017')] 
data_frame['Left'] - data_frame['Arrived']
print(data_frame.head())
dat = pd.Series(delta.days for delta in (data_frame['Left'] - data_frame['Arrived']))
print(type(dat))
dat

     Arrived       Left
0 2017-01-01 2017-01-01
1 2017-01-04 2017-01-06
<class 'pandas.core.series.Series'>

0    0
1    2
dtype: int64

In [ ]:
""" With a vector of dates we want to know the day of the week for each date. """
dates = pd.Series(pd.date_range("2/2/2002", periods=3, freq="M"))
print(dates)
print(dates.dt.day_name())
print(dates.dt.weekday)

0   2002-02-28
1   2002-03-31
2   2002-04-30
dtype: datetime64[ns]
0    Thursday
1      Sunday
2     Tuesday
dtype: object
0    3
1    6
2    1
dtype: int64

<h3 style="color:lightcoral"> Example 9 </h3>
Shift

In [ ]:
""" Shift """
dataframe = pd.DataFrame() 
dataframe["dates"] = pd.date_range("1/1/2001", periods=5, freq="D") 
dataframe["stock_price"] = [1.1,2.2,3.3,4.4,5.5] 
# Lagged values by one row 
dataframe["previous_days_stock_price"] = dataframe["stock_price"].shift(1) 
dataframe["stock_price_rolling_1"] = dataframe["stock_price"].rolling(window=1).mean()
dataframe["stock_price_rolling_2"] = dataframe["stock_price"].rolling(window=2).mean()
dataframe["stock_price_rolling_3"] = dataframe["stock_price"].rolling(window=3).mean()
dataframe["stock_price_rolling_4"] = dataframe["stock_price"].rolling(window=4).mean()

dataframe["Sales"] = [1.3, np.nan, 2.5, np.nan, np.nan]

In [ ]:
""" Interpolate. 
N.B.1
#dataframe.interpolate() # error 
N.B.2
#dataframe = dataframe.interpolate(method='linear', limit_direction='forward') #error!!
"""
dataframe["Sales"] = dataframe["Sales"].interpolate(method='linear', limit_direction='forward')
dataframe

,dates,stock_price,previous_days_stock_price,stock_price_rolling_1,stock_price_rolling_2,stock_price_rolling_3,stock_price_rolling_4,Sales
0,2001-01-01,1.1,NaN,1.1,NaN,NaN,NaN,1.3
1,2001-01-02,2.2,1.1,2.2,1.65,NaN,NaN,1.9
2,2001-01-03,3.3,2.2,3.3,2.75,2.2,NaN,2.5
3,2001-01-04,4.4,3.3,4.4,3.85,3.3,2.75,2.5
4,2001-01-05,5.5,4.4,5.5,4.95,4.4,3.85,2.5

<h3 style="color:lightcoral"> Example 10 </h3>
Reverse

In [29]:
""" Reverse the order of a Dataframe rows.

N.B.
In the absence of explicit column names, pandas uses integers starting from 0 as default column names.
N.B.1
# Use iloc indexer to access a group of rows and columns by integer-location based indexing
(data.iloc[<row selection>, <column selection>])
data.iloc[::-1] slice operation that works with iloc to get elements from the last row towards the first step by -1.
- The first part is the start index.
- The second part is the stop index.
- The third part is the step.
"""
df_8 = pd.DataFrame(np.arange(30))
df_8_r = pd.DataFrame(np.arange(30).reshape(5, -1))

# Show dataframes adding a blank line after it, to avoid printing empty line with "print()"
print(df_8, end=' \n\n') 
print(df_8_r, end=' \n\n') 
# Add columns name
df_8_r.columns = ['A', 'B', 'C', 'D', 'E', 'F']
# Filter rows
print(df_8_r.iloc[::-1, :])

     0
0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
10  10
11  11
12  12
13  13
14  14
15  15
16  16
17  17
18  18
19  19
20  20
21  21
22  22
23  23
24  24
25  25
26  26
27  27
28  28
29  29

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29

    A   B   C   D   E   F
4  24  25  26  27  28  29
3  18  19  20  21  22  23
2  12  13  14  15  16  17
1   6   7   8   9  10  11
0   0   1   2   3   4   5

In [30]:
""" Filter with iloc """
# Create a random DataFrame with 10 rows and 5 columns
x = pd.DataFrame(np.random.randint(0, 100, size=(10, 5)), columns=list('ABCDE'))
# Select rows (1, 3, 5, 7, 9) and columns (0, 2, 4) from a DataFrame
print(x, end=' \n\n') 
print(x.iloc[1:10:2, 0:5:2])

    A   B   C   D   E
0  26  48  74  41  35
1  28  76  61  84   3
2  83  42  88  35  39
3   2  96  22  75  77
4  80  62  62  89  26
5  67  22  77  87   7
6  71  88  11  28  79
7  20  68  85  35  27
8  45  80  88  82  97
9   6  63   9  22  75

    A   C   E
1  28  61   3
3   2  22  77
5  67  77   7
7  20  85  27
9   6   9  75

<h3 style="color:lightcoral"> Example 11 </h3>
Combine dataframes

In [33]:
""" Concatenate dataframes vertically and horizontally """
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'A': [7, 8, 9], 'B': [10, 11, 12]})

print(df1, end = ' \n\n')
print(df2, end = ' \n\n')

print("Concatenated vertically:")
print(pd.concat([df1, df2], axis=0))
print("\nConcatenated horizontally:")
print(pd.concat([df1, df2], axis=1))

   A  B
0  1  4
1  2  5
2  3  6

   A   B
0  7  10
1  8  11
2  9  12

Concatenated vertically:
   A   B
0  1   4
1  2   5
2  3   6
0  7  10
1  8  11
2  9  12

Concatenated horizontally:
   A  B  A   B
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

In [39]:
""" Merge """
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'B': [4, 5, 6], 'C': [7, 8, 9]})
print(df1, end = ' \n\n')
print(df2, end = ' \n\n')
print("Merged on column B:")
print(pd.merge(df1, df2, on='B'))

   A  B
0  1  4
1  2  5
2  3  6

   B  C
0  4  7
1  5  8
2  6  9

Merged on column B:
   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [51]:
%%script echo Skipping, since it will raise a MergeError
""" It is not possible to merge dataframes with no columns to merge on. 
MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False
"""
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'C': [7, 8, 9], 'D': [10, 11, 12]})
print(pd.merge(df1, df2))

Skipping, since it will raise a MergeError

In [38]:
""" Join on index """
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'C': [7, 8, 9], 'D': [10, 11, 12]})
print("Joined on index:")
print(df1.join(df2))

Joined on index:
   A  B  C   D
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

In [44]:
""" Return the rows where there is a match in both dataframes. """
df1 = pd.DataFrame({'key': ['A', 'B', 'C'], 'value1': [1, 2, 3]})
df2 = pd.DataFrame({'key': ['A', 'B', 'D'], 'value2': [4, 5, 6]})
print(df1, end = ' \n\n')
print(df2, end = ' \n\n')
print(pd.merge(df1, df2, on='key'))

  key  value1
0   A       1
1   B       2
2   C       3

  key  value2
0   A       4
1   B       5
2   D       6

  key  value1  value2
0   A       1       4
1   B       2       5

In [46]:
""" Outer Join: Return all rows from both dataframes, with NaN in places where the dataframe doesn't have a match. """
print(df1, end = ' \n\n')
print(df2, end = ' \n\n')
print(pd.merge(df1, df2, on='key', how='outer'))

  key  value1
0   A       1
1   B       2
2   C       3

  key  value2
0   A       4
1   B       5
2   D       6

  key  value1  value2
0   A     1.0     4.0
1   B     2.0     5.0
2   C     3.0     NaN
3   D     NaN     6.0

In [48]:
""" Left Join: Return all rows from the left dataframe and the matched rows from the right dataframe."""
print(df1, end = ' \n\n')
print(df2, end = ' \n\n')
print(pd.merge(df1, df2, on='key', how='left'))

  key  value1
0   A       1
1   B       2
2   C       3

  key  value2
0   A       4
1   B       5
2   D       6

  key  value1  value2
0   A       1     4.0
1   B       2     5.0
2   C       3     NaN

In [ ]:
""" Right Join: Return all rows from the right dataframe and the matched rows from the right dataframe."""
print(df1, end = ' \n\n')
print(df2, end = ' \n\n')
result = pd.merge(df1, df2, on='key', how='right')

In [50]:
""" Using columns with different names """
df1 = pd.DataFrame({'key1': ['A', 'B', 'C'], 'value1': [1, 2, 3]})
df2 = pd.DataFrame({'key2': ['A', 'B', 'D'], 'value2': [4, 5, 6]})
print(df1, end = ' \n\n')
print(df2, end = ' \n\n')
print(pd.merge(df1, df2, left_on='key1', right_on='key2'))

  key1  value1
0    A       1
1    B       2
2    C       3

  key2  value2
0    A       4
1    B       5
2    D       6

  key1  value1 key2  value2
0    A       1    A       4
1    B       2    B       5